# 44: Menata ulang penempatan kolom pada Data Frame

# Import Modules

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  1  2  7  8
1  4  6  2  7  2
2  8  2  9  2  2
3  5  6  6  4  2
4  8  5  6  8  3

# Menata ulang penempatan kolom pada Data Frame

In [9]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  7  2  8  8  1
1  7  2  4  2  6
2  2  9  8  2  2
3  4  6  5  2  6
4  8  6  8  3  5

In [11]:
df

   A  B  C  D  E
0  8  1  2  7  8
1  4  6  2  7  2
2  8  2  9  2  2
3  5  6  6  4  2
4  8  5  6  8  3

In [13]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  7  2  8  8  1
1  7  2  4  2  6
2  2  9  8  2  2
3  4  6  5  2  6
4  8  6  8  3  5